
#include <stdio.h>

int main()
{
    char a[10] = "Cat";
    printf("%s\n", a);

    a[2] = 'p';
    printf("%s\n", a);
}


/*
    Задача:

        Пусть у нас есть есть строка Cat.
        Измените в этой строке букву t на p и напечатайте её.
*/