/*
    Задача:

        Напишите программу, которая будет считывать число и печать число в 2 раза большее, чем то, что было считано

    Решение этой задачи в следующем файле
*/  

#include <stdio.h>


int main()
{
    int a;
    scanf("%i", &a);
    printf("%i\n", 2 * a);
}

