/*
    Задача:

        Напишите программу, которая будет считывать 2 числа и печатать их сумму

    Решение этой задачи в следующем файле
*/  

#include <stdio.h>


int main()
{
    int a, b;
    scanf("%i", &a);
    scanf("%i", &b);
    printf("%i\n", a + b);
}

