/*
    Задача:

        В этой программе мы создали число типа float, равное 4.2
        Потом мы печатаем это число на экран.

        Но почему-то на экран печатается не число 4.2, а какое-то другое странное число.
        В чём ошибка?
        Исправьте ошибку в этой программе так, чтобы на экран печаталось 4.2
*/

#include <stdio.h>

int main()
{
    float a = 4.2;

    printf("%i\n", a);
}

